app/controllers/console_controller.rb

  def show
    @console = Console.find(params[:id])
    @games = Game.find(:all, :conditions => { :console_id => params[:id]} )
---
SELECT * FROM "consoles" WHERE ("consoles"."id" = 12)
SELECT * FROM "games" WHERE ("games"."console_id" = E'9')

  def create
    @console = Console.new(params[:console])
    if (@console.save)
---
INSERT INTO "consoles" ("created_at", "console", "updated_at", "image_path") VALUES('2011-03-17 05:28:13.114804', E'Nintendo Gameboy', '2011-03-17 05:28:13.114804', E'/images/nintendogameboy.jpg') RETURNING "id"

  def edit
    @console = Console.find(params[:id])
---
SELECT * FROM "consoles" WHERE ("consoles"."id" = 12)

  def update
    @console = Console.find(params[:id])
    if (@console.update_attributes(params[:console]))
---
SELECT "consoles".id FROM "consoles" WHERE ("consoles"."console" = E'Sony Playstation' AND "consoles".id <> 28) LIMIT 1
UPDATE "consoles" SET "updated_at" = '2011-03-17 05:28:39.558773', "image_path" = E'/images/nintendob-gameboy.jpg' WHERE "id" = 12

  def delete
    @console = Console.find(params[:id])
---
SELECT * FROM "consoles" WHERE ("consoles"."id" = 12)

  def destroy
    Console.find(params[:id]).destroy
---
DELETE FROM "consoles" WHERE "id" = 13
SELECT * FROM "consoles" WHERE ("consoles"."id" = 13)