app/controllers/customer_controller.rb

SELECT * FROM "customers" WHERE ("customers"."id" = 75)
---
  def show
    @customer = Customer.find(params[:id])

INSERT INTO "customers" ("city", "created_at", "country", "postal_code", "updated_at", "street_address", "phone_number", "last_name", "province", "first_name", "email") VALUES(E'Surrey', '2011-03-25 00:31:02.451485', E'Canada', E'V3R7L7', '2011-03-25 00:31:02.451485', E'9104 145A St', E'604-555-5555', E'Esguerra', E'BC', E'David', E'dee@meplusfood.com') RETURNING "id"
---
  def create
    @customer = Customer.new(params[:customer])
    if @customer.save

SELECT * FROM "customers" WHERE ("customers"."id" = 75)
---
  def edit
    @customer = Customer.find(params[:id])

SELECT * FROM "customers" WHERE ("customers"."id" = 75)
UPDATE "customers" SET "updated_at" = '2011-03-25 00:39:26.462619', "postal_code" = E'V3R 7L7' WHERE "id" = 75
---
  def update
    @customer = Customer.find(params[:id])
    if @customer.update_attributes(params[:customer])

SELECT * FROM "customers" WHERE ("customers"."id" = 77)
---
  def delete
    @customer = Customer.find(params[:id])

DELETE FROM "customers" WHERE "id" = 74
SELECT * FROM "customers" WHERE ("customers"."id" = 74)
---
  def destroy
    Customer.find(params[:id]).destroy