app/controllers/developer_controller.rb

  def show
    @developer = Developer.find(params[:id])
    @games = Game.find(:all, :conditions => { :developer_id => params[:id]} )
---
SELECT * FROM "developers" WHERE ("developers"."id" = 22)
SELECT * FROM "games" WHERE ("games"."developer_id" = E'39')

  def create
    @developer = Developer.new(params[:developer])
    if (@developer.save)
---
INSERT INTO "developers" ("developer", "created_at", "updated_at", "image_path") VALUES(E'Activision', '2011-03-18 04:37:27.618686', '2011-03-18 04:37:27.618686', E'/developers/activision.jpg') RETURNING "id"

  def edit
    @developer = Developer.find(params[:id])
---
SELECT * FROM "developers" WHERE ("developers"."id" = 22)

  def update
    @developer = Developer.find(params[:id])
    if (@developer.update_attributes(params[:developer]))
---
SELECT "developers".id FROM "developers" WHERE ("developers"."developer" = E'BioWare' AND "developers".id <> 24) LIMIT 1
UPDATE "developers" SET "updated_at" = '2011-03-18 04:42:38.118727', "developer" = E'BioWare' WHERE "id" = 24

  def delete
    @developer = Developer.find(params[:id])
---
SELECT * FROM "developers" WHERE ("developers"."id" = 22)

  def destroy
    Developer.find(params[:id]).destroy
---
DELETE FROM "developers" WHERE "id" = 25
SELECT * FROM "developers" WHERE ("developers"."id" = 25)