app/controllers/feature_controller.rb

INSERT INTO "features" ("feature") VALUES(E'Downloadable') RETURNING "id"
---
  def create
    @feature = Feature.new(params[:feature])
    if (@feature.save)