app/controllers/game_controller.rb

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 40)

  def create
    @game = Game.new(params[:game])
    console = Console.find(params[:console_id])
    @game.console = console
    developer = Developer.find(params[:developer_id])
    @game.developer = developer
    publisher = Publisher.find(params[:publisher_id])
    @game.publisher = publisher
    genre = Genre.find(params[:genre_id])
    @game.genre = genre

    @features = Feature.find(:all)
    checked_features = []
    checked_params = params[:feature_list] || []
    for check_box_id in checked_params
      feature = Feature.find(check_box_id)
      if not @game.features.include?(feature)
        @game.features << feature
---
SELECT * FROM "consoles" WHERE ("consoles"."id" IS NULL) LIMIT 1
SELECT * FROM "developers" WHERE ("developers"."id" IS NULL) LIMIT 1
SELECT * FROM "publishers" WHERE ("publishers"."id" IS NULL) LIMIT 1
SELECT * FROM "genres" WHERE ("genres"."id" IS NULL) LIMIT 1
SELECT * FROM "features" WHERE ("features"."id" = 67)
SELECT "features".id FROM "features" INNER JOIN "features_games" ON "features".id = "features_games".feature_id WHERE ("features"."id" = 67) AND ("features_games".game_id = NULL ) LIMIT 1
SELECT * FROM "consoles"
SELECT * FROM "developers"
SELECT * FROM "genres"
INSERT INTO "games" ("price", "created_at", "title", "console_id", "genre_id", "updated_at", "developer_id", "release_date", "image_path", "publisher_id") VALUES(59.99, '2011-03-18 06:29:30.774549', E'NHL 11', 1, 19, '2011-03-18 06:29:30.774549', 39, '2010-09-09', E'/images/games/nhl11-xbox-360.jpg', 35) RETURNING "id"

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 40)

  def update
    @game = Game.find(params[:id])
    console = Console.find(params[:console_id])
    @game.console = console
    developer = Developer.find(params[:developer_id])
    @game.developer = developer
    publisher = Publisher.find(params[:publisher_id])
    @game.publisher = publisher
    genre = Genre.find(params[:genre_id])
    @game.genre = genre

    @features = Feature.find(:all)
    checked_features = []
    checked_params = params[:feature_list] || []
    for check_box_id in checked_params
      feature = Feature.find(check_box_id)
      if not @game.features.include?(feature)
        @game.features << feature
      end
      checked_features << feature
    end
    missing_features = @features - checked_features
    for feature in missing_features
      if @game.features.include?(feature)
         @game.features.delete(feature)
      end
    end



    if (@game.update_attributes(params[:game]))
---
SELECT * FROM "games" WHERE ("games"."id" = 40)
SELECT * FROM "consoles" WHERE ("consoles"."id" IS NULL) LIMIT 1
SELECT * FROM "developers" WHERE ("developers"."id" IS NULL) LIMIT 1
SELECT * FROM "publishers" WHERE ("publishers"."id" IS NULL) LIMIT 1
SELECT * FROM "genres" WHERE ("genres"."id" IS NULL) LIMIT 1
SELECT * FROM "features" WHERE ("features"."id" = 67)
SELECT "features".id FROM "features" INNER JOIN "features_games" ON "features".id = "features_games".feature_id WHERE ("features"."id" = 67) AND ("features_games".game_id = 42 ) LIMIT 1
SELECT * FROM "consoles"
SELECT * FROM "developers"
SELECT * FROM "genres"
UPDATE "games" SET "updated_at" = '2011-03-23 03:54:58.243984', "image_path" = E'/images/games/haloreach.jpg' WHERE "id" = 42

  def delete
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 63)

  def destroy
    Game.find(params[:id]).destroy
---
DELETE FROM "games" WHERE "id" = 63
SELECT * FROM "games" WHERE ("games"."id" = 63)