app/controllers/genre_controller.rb

SELECT * FROM "genres" WHERE ("genres"."id" = 14)
SELECT * FROM "games" WHERE ("games"."genre_id" = E'45')
---
  def show
    @genre = Genre.find(params[:id])
    @games = Game.find(:all, :conditions => { :genre_id => params[:id]} )

INSERT INTO "genres" ("created_at", "updated_at", "genre") VALUES('2011-03-18 04:18:17.550069', '2011-03-18 04:18:17.550069', E'Adventure') RETURNING "id"
---
  def create
    @genre = Genre.new(params[:genre])
    if (@genre.save)

SELECT * FROM "genres" WHERE ("genres"."id" = 14)
---
  def edit
    @genre = Genre.find(params[:id])

SELECT "genres".id FROM "genres" WHERE ("genres"."genre" = E'Music' AND "genres".id <> 14) LIMIT 1
UPDATE "genres" SET "updated_at" = '2011-03-18 04:18:33.664734', "genre" = E'Music' WHERE "id" = 14
---
  def update
    @genre = Genre.find(params[:id])
    if (@genre.update_attributes(params[:genre]))

SELECT * FROM "genres" WHERE ("genres"."id" = 14)
---
  def delete
    @genre = Genre.find(params[:id])

DELETE FROM "genres" WHERE "id" = 14
SELECT * FROM "genres" WHERE ("genres"."id" = 14)
---
  def destroy
    Genre.find(params[:id]).destroy