app/controllers/order_controller.rb

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 80)

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 83)

  def update
    @order = Order.find(params[:id])
    if @order.update_attributes(params[:order])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 83)
UPDATE "orders" SET "updated_at" = '2011-03-25 02:22:42.362730', "invoice_number" = 239489023 WHERE "id" = 83

  def delete
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 80)

  def destroy
    Order.find(params[:id]).destroy
---
DELETE FROM "orders" WHERE "id" = 80
SELECT * FROM "orders" WHERE ("orders"."id" = 80)