app/controllers/publisher_controller.rb

  def show
    @publisher = Publisher.find(params[:id])
    @games = Game.find(:all, :conditions => { :publisher_id => params[:id]} )
---
SELECT * FROM "publishers" WHERE ("publishers"."id" = 34)
SELECT * FROM "games" WHERE ("games"."publisher_id" = E'34')

  def create
    @publisher = Publisher.new(params[:publisher])
    if (@publisher.save)
---
INSERT INTO "publishers" ("created_at", "updated_at", "publisher", "image_path") VALUES('2011-03-18 04:53:32.252435', '2011-03-18 04:53:32.252435', E'Activision', E'/images/publishers/activision.jpg') RETURNING "id"

  def edit
    @publisher = Publisher.find(params[:id])
---
SELECT * FROM "publishers" WHERE ("publishers"."id" = 35)