app/controllers/public_controller.rb

SELECT * FROM "games" WHERE ("games"."id" = 42)
---
  def show
    @game = Game.find(params[:id])

SELECT * FROM "games" WHERE ("games"."id" = 72)
---
  def add_to_cart
    @game = Game.find(params[:id])

SELECT * FROM "games" WHERE ("games"."id" = 47)
---
  def remove_from_cart
    game = Game.find(params[:id])

INSERT INTO "line_items" ("price", "quantity", "order_id", "game_id") VALUES(5.99, 1, 80, 72) RETURNING "id"
INSERT INTO "orders" ("created_at", "updated_at", "invoice_number", "customer_id") VALUES('2011-03-25 02:06:04.317666', '2011-03-25 02:06:04.317666', NULL, 79) RETURNING "id"
INSERT INTO "customers" ("city", "created_at", "country", "postal_code", "updated_at", "street_address", "phone_number", "last_name", "province", "first_name", "email") VALUES(E'Surrey', '2011-03-25 02:06:04.309165', E'Canada', E'V3R7L7', '2011-03-25 02:06:04.309165', E'9104 145A St', E'504', E'Esguerra', E'BC', E'David', E'dee@test.com') RETURNING "id"
---
  def save_order
    @customer = Customer.new(params[:customer])
    #credit_card_number = params[:credit_card]
    @order = Order.new
    @order.line_items << @cart.items
    @customer.orders << @order

SELECT * FROM "orders" WHERE ("orders"."id" = 80)
---
  def show_receipt
    @order = Order.find(params[:id])