app/controllers/user_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "hashed_password", "email") VALUES(E'asdffda', '2011-03-25 02:53:44.213370', '2011-03-25 02:53:44.213370', E'dde93f95d664df0c518e10bff196d9111e30e7ad', E'd_esguerra_3@hotmail.com') RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if (@user.save)

SELECT * FROM "users" WHERE ("users"."id" = 96)
UPDATE "users" SET "updated_at" = '2011-03-25 03:42:23.637167', "name" = E'asdfasdfasds23' WHERE "id" = 97
---
  def update
    @user = User.find(params[:id])
    if (@user.update_attributes(params[:user]))

SELECT * FROM "users" WHERE ("users"."id" = 97)
---
  def delete
    @user = User.find(params[:id])

DELETE FROM "users" WHERE "id" = 97
SELECT * FROM "users" WHERE ("users"."id" = 97)
---
  def destroy
    User.find(params[:id]).destroy